; domain
; source: https://github.com/AI-Planning/pddl-generators/blob/main/ferry/domain.pddl
; updates: typing car and locations; sail precs have now (not (at-ferry ?to)) so (not-eq ?from ?to) can be removed
(define (domain ferry)
   (:requirements :typing :strips :negative-preconditions)
   (:types
        car - object
        location - object )

   (:predicates
		(at-ferry ?l - location)
		(at ?c - car ?l - location)
		(empty-ferry)
		(on ?c - car))

   (:action sail
       :parameters  (?from - location ?to - location)
       :precondition (and (at-ferry ?from) (not (at-ferry ?to)))
       :effect (and  (at-ferry ?to) (not (at-ferry ?from))))


   (:action board
       :parameters (?car - car ?loc - location)
       :precondition  (and  (at ?car ?loc) (at-ferry ?loc) (empty-ferry))
       :effect (and
            (on ?car)
		    (not (at ?car ?loc)) 
		    (not (empty-ferry))))

   (:action debark
       :parameters  (?car - car  ?loc - location)
       :precondition  (and (on ?car) (at-ferry ?loc))
       :effect (and
            (at ?car ?loc)
		    (empty-ferry)
		    (not (on ?car)))))

; problem
;; cars=20, locations=15, out_folder=training/easy, instance_id=96, seed=126

(define (problem ferry-96)
 (:domain ferry)
 (:objects 
    car1 car2 car3 car4 car5 car6 car7 car8 car9 car10 car11 car12 car13 car14 car15 car16 car17 car18 car19 car20 - car
    loc1 loc2 loc3 loc4 loc5 loc6 loc7 loc8 loc9 loc10 loc11 loc12 loc13 loc14 loc15 - location
 )
 (:init 
    (empty-ferry)
    (at-ferry loc10)
    (at car1 loc1)
    (at car2 loc10)
    (at car3 loc10)
    (at car4 loc8)
    (at car5 loc4)
    (at car6 loc11)
    (at car7 loc3)
    (at car8 loc8)
    (at car9 loc15)
    (at car10 loc8)
    (at car11 loc4)
    (at car12 loc3)
    (at car13 loc11)
    (at car14 loc3)
    (at car15 loc15)
    (at car16 loc11)
    (at car17 loc8)
    (at car18 loc2)
    (at car19 loc12)
    (at car20 loc11)
)
 (:goal  (and (at car1 loc6)
   (at car2 loc9)
   (at car3 loc3)
   (at car4 loc6)
   (at car5 loc5)
   (at car6 loc14)
   (at car7 loc9)
   (at car8 loc7)
   (at car9 loc1)
   (at car10 loc7)
   (at car11 loc8)
   (at car12 loc14)
   (at car13 loc5)
   (at car14 loc9)
   (at car15 loc8)
   (at car16 loc9)
   (at car17 loc1)
   (at car18 loc14)
   (at car19 loc11)
   (at car20 loc2))))

; plan
1. (sail loc10 loc1)
   deleted: (at-ferry loc10)
   added: (at-ferry loc1)
   goals met: 0 of 20
2. (board car1 loc1)
   deleted: (at car1 loc1) (empty-ferry)
   added: (on car1)
   goals met: 0 of 20
3. (sail loc1 loc6)
   deleted: (at-ferry loc1)
   added: (at-ferry loc6)
   goals met: 0 of 20
4. (debark car1 loc6)
   deleted: (on car1)
   added: (at car1 loc6) (empty-ferry)
   goals met: 1 of 20
5. (sail loc6 loc10)
   deleted: (at-ferry loc6)
   added: (at-ferry loc10)
   goals met: 1 of 20
6. (board car2 loc10)
   deleted: (at car2 loc10) (empty-ferry)
   added: (on car2)
   goals met: 1 of 20
7. (sail loc10 loc9)
   deleted: (at-ferry loc10)
   added: (at-ferry loc9)
   goals met: 1 of 20
8. (debark car2 loc9)
   deleted: (on car2)
   added: (at car2 loc9) (empty-ferry)
   goals met: 2 of 20
9. (sail loc9 loc10)
   deleted: (at-ferry loc9)
   added: (at-ferry loc10)
   goals met: 2 of 20
10. (board car3 loc10)
   deleted: (at car3 loc10) (empty-ferry)
   added: (on car3)
   goals met: 2 of 20
11. (sail loc10 loc3)
   deleted: (at-ferry loc10)
   added: (at-ferry loc3)
   goals met: 2 of 20
12. (debark car3 loc3)
   deleted: (on car3)
   added: (at car3 loc3) (empty-ferry)
   goals met: 3 of 20
13. (sail loc3 loc8)
   deleted: (at-ferry loc3)
   added: (at-ferry loc8)
   goals met: 3 of 20
14. (board car4 loc8)
   deleted: (at car4 loc8) (empty-ferry)
   added: (on car4)
   goals met: 3 of 20
15. (sail loc8 loc6)
   deleted: (at-ferry loc8)
   added: (at-ferry loc6)
   goals met: 3 of 20
16. (debark car4 loc6)
   deleted: (on car4)
   added: (at car4 loc6) (empty-ferry)
   goals met: 4 of 20
17. (sail loc6 loc4)
   deleted: (at-ferry loc6)
   added: (at-ferry loc4)
   goals met: 4 of 20
18. (board car5 loc4)
   deleted: (at car5 loc4) (empty-ferry)
   added: (on car5)
   goals met: 4 of 20
19. (sail loc4 loc5)
   deleted: (at-ferry loc4)
   added: (at-ferry loc5)
   goals met: 4 of 20
20. (debark car5 loc5)
   deleted: (on car5)
   added: (at car5 loc5) (empty-ferry)
   goals met: 5 of 20
21. (sail loc5 loc11)
   deleted: (at-ferry loc5)
   added: (at-ferry loc11)
   goals met: 5 of 20
22. (board car6 loc11)
   deleted: (at car6 loc11) (empty-ferry)
   added: (on car6)
   goals met: 5 of 20
23. (sail loc11 loc14)
   deleted: (at-ferry loc11)
   added: (at-ferry loc14)
   goals met: 5 of 20
24. (debark car6 loc14)
   deleted: (on car6)
   added: (at car6 loc14) (empty-ferry)
   goals met: 6 of 20
25. (sail loc14 loc3)
   deleted: (at-ferry loc14)
   added: (at-ferry loc3)
   goals met: 6 of 20
26. (board car7 loc3)
   deleted: (at car7 loc3) (empty-ferry)
   added: (on car7)
   goals met: 6 of 20
27. (sail loc3 loc9)
   deleted: (at-ferry loc3)
   added: (at-ferry loc9)
   goals met: 6 of 20
28. (debark car7 loc9)
   deleted: (on car7)
   added: (at car7 loc9) (empty-ferry)
   goals met: 7 of 20
29. (sail loc9 loc8)
   deleted: (at-ferry loc9)
   added: (at-ferry loc8)
   goals met: 7 of 20
30. (board car8 loc8)
   deleted: (at car8 loc8) (empty-ferry)
   added: (on car8)
   goals met: 7 of 20
31. (sail loc8 loc7)
   deleted: (at-ferry loc8)
   added: (at-ferry loc7)
   goals met: 7 of 20
32. (debark car8 loc7)
   deleted: (on car8)
   added: (at car8 loc7) (empty-ferry)
   goals met: 8 of 20
33. (sail loc7 loc15)
   deleted: (at-ferry loc7)
   added: (at-ferry loc15)
   goals met: 8 of 20
34. (board car9 loc15)
   deleted: (at car9 loc15) (empty-ferry)
   added: (on car9)
   goals met: 8 of 20
35. (sail loc15 loc1)
   deleted: (at-ferry loc15)
   added: (at-ferry loc1)
   goals met: 8 of 20
36. (debark car9 loc1)
   deleted: (on car9)
   added: (at car9 loc1) (empty-ferry)
   goals met: 9 of 20
37. (sail loc1 loc8)
   deleted: (at-ferry loc1)
   added: (at-ferry loc8)
   goals met: 9 of 20
38. (board car10 loc8)
   deleted: (at car10 loc8) (empty-ferry)
   added: (on car10)
   goals met: 9 of 20
39. (sail loc8 loc7)
   deleted: (at-ferry loc8)
   added: (at-ferry loc7)
   goals met: 9 of 20
40. (debark car10 loc7)
   deleted: (on car10)
   added: (at car10 loc7) (empty-ferry)
   goals met: 10 of 20
41. (sail loc7 loc4)
   deleted: (at-ferry loc7)
   added: (at-ferry loc4)
   goals met: 10 of 20
42. (board car11 loc4)
   deleted: (at car11 loc4) (empty-ferry)
   added: (on car11)
   goals met: 10 of 20
43. (sail loc4 loc8)
   deleted: (at-ferry loc4)
   added: (at-ferry loc8)
   goals met: 10 of 20
44. (debark car11 loc8)
   deleted: (on car11)
   added: (at car11 loc8) (empty-ferry)
   goals met: 11 of 20
45. (sail loc8 loc3)
   deleted: (at-ferry loc8)
   added: (at-ferry loc3)
   goals met: 11 of 20
46. (board car12 loc3)
   deleted: (at car12 loc3) (empty-ferry)
   added: (on car12)
   goals met: 11 of 20
47. (sail loc3 loc14)
   deleted: (at-ferry loc3)
   added: (at-ferry loc14)
   goals met: 11 of 20
48. (debark car12 loc14)
   deleted: (on car12)
   added: (at car12 loc14) (empty-ferry)
   goals met: 12 of 20
49. (sail loc14 loc11)
   deleted: (at-ferry loc14)
   added: (at-ferry loc11)
   goals met: 12 of 20
50. (board car13 loc11)
   deleted: (at car13 loc11) (empty-ferry)
   added: (on car13)
   goals met: 12 of 20
51. (sail loc11 loc5)
   deleted: (at-ferry loc11)
   added: (at-ferry loc5)
   goals met: 12 of 20
52. (debark car13 loc5)
   deleted: (on car13)
   added: (at car13 loc5) (empty-ferry)
   goals met: 13 of 20
53. (sail loc5 loc3)
   deleted: (at-ferry loc5)
   added: (at-ferry loc3)
   goals met: 13 of 20
54. (board car14 loc3)
   deleted: (at car14 loc3) (empty-ferry)
   added: (on car14)
   goals met: 13 of 20
55. (sail loc3 loc9)
   deleted: (at-ferry loc3)
   added: (at-ferry loc9)
   goals met: 13 of 20
56. (debark car14 loc9)
   deleted: (on car14)
   added: (at car14 loc9) (empty-ferry)
   goals met: 14 of 20
57. (sail loc9 loc15)
   deleted: (at-ferry loc9)
   added: (at-ferry loc15)
   goals met: 14 of 20
58. (board car15 loc15)
   deleted: (at car15 loc15) (empty-ferry)
   added: (on car15)
   goals met: 14 of 20
59. (sail loc15 loc8)
   deleted: (at-ferry loc15)
   added: (at-ferry loc8)
   goals met: 14 of 20
60. (debark car15 loc8)
   deleted: (on car15)
   added: (at car15 loc8) (empty-ferry)
   goals met: 15 of 20
61. (sail loc8 loc11)
   deleted: (at-ferry loc8)
   added: (at-ferry loc11)
   goals met: 15 of 20
62. (board car16 loc11)
   deleted: (at car16 loc11) (empty-ferry)
   added: (on car16)
   goals met: 15 of 20
63. (sail loc11 loc9)
   deleted: (at-ferry loc11)
   added: (at-ferry loc9)
   goals met: 15 of 20
64. (debark car16 loc9)
   deleted: (on car16)
   added: (at car16 loc9) (empty-ferry)
   goals met: 16 of 20
65. (sail loc9 loc8)
   deleted: (at-ferry loc9)
   added: (at-ferry loc8)
   goals met: 16 of 20
66. (board car17 loc8)
   deleted: (at car17 loc8) (empty-ferry)
   added: (on car17)
   goals met: 16 of 20
67. (sail loc8 loc1)
   deleted: (at-ferry loc8)
   added: (at-ferry loc1)
   goals met: 16 of 20
68. (debark car17 loc1)
   deleted: (on car17)
   added: (at car17 loc1) (empty-ferry)
   goals met: 17 of 20
69. (sail loc1 loc2)
   deleted: (at-ferry loc1)
   added: (at-ferry loc2)
   goals met: 17 of 20
70. (board car18 loc2)
   deleted: (at car18 loc2) (empty-ferry)
   added: (on car18)
   goals met: 17 of 20
71. (sail loc2 loc14)
   deleted: (at-ferry loc2)
   added: (at-ferry loc14)
   goals met: 17 of 20
72. (debark car18 loc14)
   deleted: (on car18)
   added: (at car18 loc14) (empty-ferry)
   goals met: 18 of 20
73. (sail loc14 loc12)
   deleted: (at-ferry loc14)
   added: (at-ferry loc12)
   goals met: 18 of 20
74. (board car19 loc12)
   deleted: (at car19 loc12) (empty-ferry)
   added: (on car19)
   goals met: 18 of 20
75. (sail loc12 loc11)
   deleted: (at-ferry loc12)
   added: (at-ferry loc11)
   goals met: 18 of 20
76. (debark car19 loc11)
   deleted: (on car19)
   added: (at car19 loc11) (empty-ferry)
   goals met: 19 of 20
77. (board car20 loc11)
   deleted: (at car20 loc11) (empty-ferry)
   added: (on car20)
   goals met: 19 of 20
78. (sail loc11 loc2)
   deleted: (at-ferry loc11)
   added: (at-ferry loc2)
   goals met: 19 of 20
79. (debark car20 loc2)
   deleted: (on car20)
   added: (at car20 loc2) (empty-ferry)
   goals met: 20 of 20
